import { TextFields } from "../types/interfaces";

export const TextRu: TextFields = {
    navElems: ["О себе", "Навыки", "Проекты", "Контакты", "Образование"],

    name: "Алексей Стояненко",

    spec: "Junior Front-End Developer",

    languageRu: "Русский - носитель",

    languageEn: "Английский - B2",

    languageTitle: "Языки",

    location: "Россия, Челябинск",

    aboutText: `Привет! Я начинающий Front-End разработчик. Мне нравится писать код и создавать приложения. В разработке в первую очередь привлекает возможность постоянно совершенствоваться и приобретать новые навыки. 
    По образованию я врач, благодаря этому могу быстро усваивать большие объемы и информации.
    Стрессоустойчив, умею находить подход к людям.`,

    momentumDescr: `Копия расширения для браузера Chrome. Показывает время и погоду для локации пользователя, может проигрывать музыку из встроенного плейлиста.
    В приложении есть возможность включать и отключать отдельные эелементы, менять фоновое изображение. Поддерживаются два языка.`,

    songBirdDescr: `Аудио викториан в которой необходимо угадать птицу по её песне. В приложении реализована галерея с изображениями всех птиц и с возможностью прослушать их песни. 
    Поддерживается два языка.`,

    gemPuzzleDescr: `Игра пазл в которой необходимо выстроить все плитки по порядку. Плитки можно перетаскивать или передвигать нажатием.
     Сложность регулируется с помощью изменения размера игрового поля. Все результаты сохраняются в таблицу рекордов.`,

    shopDescr: `Онлайн магазин. Реализованы фильтры товаров по имени, бренду, цене и количеству на складе. Приложение одностраничное, реализован роутинг.`,

    seaBattleDescr: `Игра морской бой. Два режима: одиночный и многопльзовательский. Поддерживается авторизация, вся информация хронится в базе данных.`,

    code: "Код",

    deploy: "Сайт",

    back: "Бэкэнд",

    educationTextOne: "Южно-Уральский Государтсвенный Медицинский Университет, Врач ультразвуковой диагностики.",
};
